import React from "react";

function About() {
  return (
    <div>
      <h6>תנאי השימוש באתר</h6>
      <p className="sumery">
        פרויקט זה הוא תוצר של האקתון מיכל סלה Safe@Home הההאקתון הראשון בישראל
        להצלת חיים ומיגור אלימות לתשומת לבך! השימוש באתר כפוף לאמור בתנאי השימוש
        שלהלן. כמו כן, השימוש באתר מעיד על הסכמה לתנאי שימוש אלה. תנאי השימוש
        והתכנים באתר נערכו בלשון נקבה, אך הם מיועדים לגברים ולנשים כאחד :אחריות
        האתר והמידע המופיע בו אינו מהווה ייעוץ משפטי ו/או תחליף לייעוץ משפטי
        ו/או לכל ייעוץ מסוג הסתמכות על המידע המופיע באתר ו/או על התכנים המופיעים
        באתר הינה באחריות המשתמש בלבד.
      </p>
    </div>
  );
}
export default About;
