import React, { useState} from "react";
import SendMsg from "../SendMsg";

const ThirdStage = () => {
  const [showSummery, setShowSummery] = useState(true);
  const msg = `היי,
  שולחת לך את ההודעה הזאת מכיוון שעלו לי לאחרונה כל מיני סימני שאלה לגבי מערכת היחסים הזוגית שלי,  אני מבולבלת ולא בטוחה מה אני רוצה לעשות עם זה. 
  בנתיים אשמח שנקבע לדבר על זה בפרטיות ומבלי שתשתפ/י עוד מישהו בזה.
  `

  const sendMsg = () =>{
    setShowSummery(false);
  }

  return (
    <div className="about">
      <h1 className="header">לפרוש כנפיים ולעוף</h1>

      {
        showSummery ? 
        <p className="sumery">
          נראה שאת רואה כמה סימני אזהרה של קשר זוגי פוגעני. אל תיתעלמי מהנורות
          האדומות האלה. משהו שמתחיל בקטן יכול להחמיר עם הזמן. שום מערכת יחסים אינה
          מושלמת, תמיד היא דורשת עבודה, אך במערכת יחסים בריאה לא תמצאי התנהגויות
          פוגעות. הצעד הראשון הוא לשוחח עם אדם אחר מחוץ למערכת היחסים ולשתף במה
          שעובר עלייך. את לא צריכה להיות לבד אנחנו כאן כדי לעזור לך. את יכולה
          לבחור מה הכי נכון לך מהאפשרויות הבאות:<br/>
          - בלחיצה על הקישור הבא תועברי
          למסך בו יחכה עבורך מכתב קצר אותו תוכלי לשלוח לאדם קרוב שאת סומכת עליו
          (חבר/ה קרוב/ה, קרוב/ת משפחה או כל אדם אחר שתבחרי).<br/>
          <b>זכרי:</b>
           יצירת קשר עם אדם מחוץ למערכת היחסים
          יכולה להציל את חייך. <br/>
          <button type="button" class="btn btn-link sendBtn wingsBtn" onClick={() => sendMsg()}>שליחת הודעה לאדם קרוב</button>
          <br/>
          - אם אינך רוצה לפנות למישהו שאת מכירה ורוצה להישאר
          אנונימית, את יכולה להתקשר 
          <b> עכשיו </b>
          למספר 118 או לשלוח הודעה למספר טלפון:
          055-7000128, 24 שעות ביממה. <br/>
          במוקד יושבים אנשי מקצוע שיוכלו לייעץ לך.
        </p>
        : <SendMsg msg={msg}/>
      }
    </div>
  );
};
export default ThirdStage;
