import React from 'react';
import 'materialize-css/dist/css/materialize.min.css';

const About = () => {

    return <div className=' flex-container'>
     

       <h3 class="truncate col s4 m2">לפרוש כנפיים ולעוף</h3> 
        <p class="center-align">
           <span>  נראה שאת רואה כמה סימני אזהרה של קשר זוגי פוגעני</span>
 
 .אל תתעלמי מהדגלים האדומים האלה
 .משהו שמתחיל בקטן יכול להחמיר עם הזמן 
 ,שום מערכת יחסים אינה מושלמת, היא דורשת עבודה 
 .אך במערכת יחסים בריאה לא תמצאי התנהגויות פוגעות
 
 הצעד הראשון הוא לשוחח עם אדם אחר מחוץ למערכת היחסים 
 .ולשתף במה שעובר עלייך 
 .את לא צריכה להיות לבד, אנחנו כאן כדי לעזור לך 
 
 :את יכולה לבחור מה הכי נכון לך מהאפשרויות הבאות 
 בלחיצה כאן תועברי למסך בו יחכה עבורך טקסט קצר אותו תוכלי לשלוח לאדם קרוב שאת סומכת עליו (חבר/ה, 
 .קרוב/ת משפחה או כל אדם אחר שתבחרי)
 ,לבחירתך SMS הטקסט ישלח במייל או בהודעת
 .ממספר אנונימי ולא ישאיר עקבות
 .זכרי - יצירת קשר עם אדם נוסף יכולה להציל את חייך 
 להעדפתך, את יכולה להתקשר ל- 118 או לשלוח הודעה 
 .ל- 055-7000128, 24 שעות ביממה
 .במוקד יושבים אנשי מקצוע שיוכלו לייעץ לך </p>
 
 
 
 
      </div>
    
}
export default About;