
import React, { useState } from 'react';



const FirstStage = (props) => {


    return <div className='about'  col s12 m6>
          
        
 
       <h1 className='header'>לפרוש כנפיים ולעוף</h1> 
        <p className='sumery'> 
--נשמע שמערכת היחסים שלכם נמצאת במסלול בריא, 
יתכן שיש לך חברה שלא נמצאת במערכת יחסים בריאה.
 אם את מכירה מישהי שנמצאת במערכת יחסים פוגענית, את יכולה ללחוץ על כפתור שתף
  , היא תקבל את השאלון בעילום שם 
   בנוסף אפשר לשתף את השאלון עם כל מי שזה נראה לך רלוונטי עבורה.כרגע בבדיקה -- אל תדאגי היא לא תוכל לדעת מי שלח לה את השאלון.
בנוסף קיימים בקהילה מענים לכל שאלה לגבי זוגיות בריאה ומשפחה שתוכלי להיכנס אליהם בכל עת. 
כמו כן ניתן להיכנס לאתר משרד  הרווחה לקבל מידע 
<a>https://domestic-violence-program.org.il </a>   </p>

      </div>
    
}
export default FirstStage;